Задание 1
Ответьте на вопрос в свободной форме.

Чем контейнеризация отличается от виртуализации?

Задание 2
Выполните действия:

Установите Docker.
Приложите скриншот.

![]1.png
Задание 3
Выполните действия:

Запустите образ hello-world.
Приложите скриншот.

![]2.png
Задание 4
Выполните действия:

Удалите образ hello-world.
Приложите скриншот.

![]3.png
Дополнительные задания* (со звёздочкой)
Их выполнение необязательное и не влияет на получение зачёта по домашнему заданию. Можете их решить, если хотите лучше разобраться в материале.

Задание 5*
Найдите в Docker Hub образ apache и установите его.
Приложите:
скриншоты сетевых настроек вашей виртуальной машины;
скриншоты работающих контейнеров;
скриншот браузера, где вы открыли дефолтную страницу вашего apache внутри контейнера.
Задание 6*
Создайте свой Docker образ с Apache2 и подмените стандартную страницу index.html на страницу, содержащую ваши ФИО.
Приложите:
скриншот содержимого Dockerfile;
скриншот браузера, где apache2 из вашего контейнера выводит ваши ФИО.